---
kind: property
id: P:Autodesk.Revit.UI.TextBoxData.Image
source: html/03062e3e-2bc9-7e75-a8ce-8822889ff8ef.htm
---
# Autodesk.Revit.UI.TextBoxData.Image Property

The image of the TextBox.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.